clough42/electronic-leadscrew/testfixture-f280049c/device_support_f28004x/headers/source/f28004x_globalvariabledefs.c
//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("Sdfm1RegsFile")
#else
#pragma DATA_SECTION(Sdfm1Regs,"Sdfm1RegsFile");
#endif
volatile struct SDFM_REGS Sdfm1Regs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("SpiaRegsFile")
#else
#pragma DATA_SECTION(SpiaRegs,"SpiaRegsFile");
#endif
volatile struct SPI_REGS SpiaRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("SpibRegsFile")
#else
#pragma DATA_SECTION(SpibRegs,"SpibRegsFile");
#endif
volatile struct SPI_REGS SpibRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("WdRegsFile")
#else
#pragma DATA_SECTION(WdRegs,"WdRegsFile");
#endif
volatile struct WD_REGS WdRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("DmaClaSrcSelRegsFile")
#else
#pragma DATA_SECTION(DmaClaSrcSelRegs,"DmaClaSrcSelRegsFile");
#endif
volatile struct DMA_CLA_SRC_SEL_REGS DmaClaSrcSelRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("DevCfgRegsFile")
#else
#pragma DATA_SECTION(DevCfgRegs,"DevCfgRegsFile");
#endif
volatile struct DEV_CFG_REGS DevCfgRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("ClkCfgRegsFile")
#else
#pragma DATA_SECTION(ClkCfgRegs,"ClkCfgRegsFile");
#endif
volatile struct CLK_CFG_REGS ClkCfgRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("CpuSysRegsFile")
#else
#pragma DATA_SECTION(CpuSysRegs,"CpuSysRegsFile");
#endif
volatile struct CPU_SYS_REGS CpuSysRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("SysPeriphAcRegsFile")
#else
#pragma DATA_SECTION(SysPeriphAcRegs,"SysPeriphAcRegsFile");
#endif
volatile struct PERIPH_AC_REGS SysPeriphAcRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EnhancedDebugGlobalRegsFile")
#else
#pragma DATA_SECTION(EnhancedDebugGlobalRegs,"EnhancedDebugGlobalRegsFile");
#endif
volatile struct ERAD_GLOBAL_REGS EnhancedDebugGlobalRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EnhancedDebugHWBP1RegsFile")
#else
#pragma DATA_SECTION(EnhancedDebugHWBP1Regs,"EnhancedDebugHWBP1RegsFile");
#endif
volatile struct ERAD_HWBP_REGS EnhancedDebugHWBP1Regs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EnhancedDebugHWBP2RegsFile")
#else
#pragma DATA_SECTION(EnhancedDebugHWBP2Regs,"EnhancedDebugHWBP2RegsFile");
#endif
volatile struct ERAD_HWBP_REGS EnhancedDebugHWBP2Regs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EnhancedDebugHWBP3RegsFile")
#else
#pragma DATA_SECTION(EnhancedDebugHWBP3Regs,"EnhancedDebugHWBP3RegsFile");
#endif
volatile struct ERAD_HWBP_REGS EnhancedDebugHWBP3Regs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EnhancedDebugHWBP4RegsFile")
#else
#pragma DATA_SECTION(EnhancedDebugHWBP4Regs,"EnhancedDebugHWBP4RegsFile");
#endif
volatile struct ERAD_HWBP_REGS EnhancedDebugHWBP4Regs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EnhancedDebugHWBP5RegsFile")
#else
#pragma DATA_SECTION(EnhancedDebugHWBP5Regs,"EnhancedDebugHWBP5RegsFile");
#endif
volatile struct ERAD_HWBP_REGS EnhancedDebugHWBP5Regs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EnhancedDebugHWBP6RegsFile")
#else
#pragma DATA_SECTION(EnhancedDebugHWBP6Regs,"EnhancedDebugHWBP6RegsFile");
#endif
volatile struct ERAD_HWBP_REGS EnhancedDebugHWBP6Regs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EnhancedDebugHWBP7RegsFile")
#else
#pragma DATA_SECTION(EnhancedDebugHWBP7Regs,"EnhancedDebugHWBP7RegsFile");
#endif
volatile struct ERAD_HWBP_REGS EnhancedDebugHWBP7Regs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EnhancedDebugHWBP8RegsFile")
#else
#pragma DATA_SECTION(EnhancedDebugHWBP8Regs,"EnhancedDebugHWBP8RegsFile");
#endif
volatile struct ERAD_HWBP_REGS EnhancedDebugHWBP8Regs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EnhancedDebugCounter1RegsFile")
#else
#pragma DATA_SECTION(EnhancedDebugCounter1Regs,"EnhancedDebugCounter1RegsFile");
#endif
volatile struct ERAD_COUNTER_REGS EnhancedDebugCounter1Regs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EnhancedDebugCounter2RegsFile")
#else
#pragma DATA_SECTION(EnhancedDebugCounter2Regs,"EnhancedDebugCounter2RegsFile");
#endif
volatile struct ERAD_COUNTER_REGS EnhancedDebugCounter2Regs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EnhancedDebugCounter3RegsFile")
#else
#pragma DATA_SECTION(EnhancedDebugCounter3Regs,"EnhancedDebugCounter3RegsFile");
#endif
volatile struct ERAD_COUNTER_REGS EnhancedDebugCounter3Regs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EnhancedDebugCounter4RegsFile")
#else
#pragma DATA_SECTION(EnhancedDebugCounter4Regs,"EnhancedDebugCounter4RegsFile");
#endif
volatile struct ERAD_COUNTER_REGS EnhancedDebugCounter4Regs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("SyncSocRegsFile")
#else
#pragma DATA_SECTION(SyncSocRegs,"SyncSocRegsFile");
#endif
volatile struct SYNC_SOC_REGS SyncSocRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("XintRegsFile")
#else
#pragma DATA_SECTION(XintRegs,"XintRegsFile");
#endif
volatile struct XINT_REGS XintRegs;



//===========================================================================
// End of file.
//===========================================================================

